{
  "articles": [
    {
      "id": 1,
      "title": "Norris beats Verstappen for breakthrough maiden F1 victory in action-packed Miami Grand Prix",
      "subtitle": "McLaren driver Lando Norris added his name to the list of Formula 1 race winners with a sensational breakthrough victory in Sundays Miami Grand Prix, overhauling Red Bull rival Max Verstappen to take the chequered flag.",
      "text": "Norris ran sixth in the early stages of the race, with fast-starting team mate Oscar Piastri the McLaren man who initially looked most likely to cause an upset, but a Safety Car at the midway point played perfectly into the Briton’s hands after he extended his opening stint.\n Norris emerged from the pits in the lead, with Verstappen demoted to second after stopping under normal racing conditions, and despite an initial attack from the latter at the restart, the Briton managed to maintain the position and then edge clear.\n A cool, calm and collected performance thereafter, and balance problems for Verstappen, meant there was no stopping Norris from banishing the demons of his near-miss at the 2021 Russian Grand Prix and becoming a race winner at the 110th time of asking.Verstappen settled for second amid his relative struggles behind the wheel, while Charles Leclerc completed the podium ahead of Ferrari team mate Carlos Sainz, who clashed with Piastri late on in an incident that sent the Australian back into the pits for a new front wing.\n Sergio Perez wound up fifth in the second of the Red Bulls, having completed another stop under the Safety Car, as Lewis Hamilton and George Russell salvaged some solid points on a challenging weekend for Mercedes in sixth and eighth respectively.\n Yuki Tsunoda gave RB another reward in seventh, while Aston Martin’s Fernando Alonso crossed the line ninth and Esteban Ocon capitalised on Piastri’s problems to finish 10th and score a morale-boosting first point of the season for the Alpine team.\nn Haas had been on course for another top-10 result in the opening exchanges, only for Nico Hulkenberg to slip down the order as the race developed, leaving him 11th at the flag from the other Alpine machine of Pierre Gasly.\nn Piastri battled his way back up to 13th after that aforementioned front wing change, albeit being warned by McLaren not to spark another incident and Safety Car period as Norris led, clearing Zhou Guanyu’s Kick Sauber just before the finish.\n After starring in the Sprint, Daniel Ricciardo could do no more than 15th on Grand Prix day, followed by Valtteri Bottas (Kick Sauber) and Lance Stroll (Aston Martin), whose fierce battle with Williams rival Alex Albon saw him earn a 10-second time penalty for leaving the track and gaining an advantage.\n Albon was the final finisher in 19th, behind the Haas of Kevin Magnussen, who served a 10-second sanction of his own for a collision with Williams driver Logan Sargeant that put the home favourite out of the race.\n As the drivers headed back to the pits, the emotions came out for Norris over the radio as he and his race engineer, along with team boss Zak Brown, revelled in a milestone moment that also gave McLaren a first Grand Prix win since Monza back in 2021.\n After an action-packed double-header of the Sprint race and Grand Prix qualifying on Saturday, which reigning world champion Verstappen mastered, attention soon turned to Sunday’s main event and 57 laps around the Miami International Autodrome.\n Only one change was made to the starting order after the grid-deciding session, with Ricciardo going from 18th to 20th thanks to the application of a three-place penalty he picked up at the previous race in China for breaching the Safety Car regulations.\n When the field lined up on the grid and the tyre blankets came off, it was confirmed that most drivers would be starting on the medium rubber, while Hamilton, Alonso, Magnussen and Ricciardo opted for hards, and Bottas softs, in what Pirelli expected to be a one-stop encounter.\n Pole-sitter Verstappen managed to defend his lead off the line for the second time this weekend as the race got under way, slotting in front of squabbling team mates Leclerc and Sainz, who had to take avoiding action when Perez dramatically locked up and fired his way into the first corner.\n Perez’s mistake, along with the Ferraris almost banging wheels, opened the door for Piastri to pull off a remarkable rise from sixth to third at the exit of Turn 1, just behind Leclerc, with Sainz slipping back to fourth from the recovering Perez, Norris, Hamilton and Hulkenberg.\n Further back, Alpine pair Ocon and Gasly went wheel-to-wheel for several corners in an exchange that no doubt raised heartrates on the Alpine pit wall, until the latter settled it in his favour, while Hulkenberg pounced on the hard-shod Hamilton at the start of Lap 2 for seventh.\n A couple of tours later, rather than looking in his mirrors, Piastri edged closer to Leclerc and used the Drag Reduction System on the lengthy run between Turns 16 and 17 to snatch second place from the Monegasque, as race leader Verstappen now sat two seconds up the road.\n As the race settled down, a series of opening lap replays, including an onboard from Perez, showed that the Mexican came perilously close to running into the back of team mate Verstappen at Turn 1, with the stewards looking into a potential jump start before deciding against any further action.\n With his hard tyres coming into play, Hamilton muscled his way past Hulkenberg for P7 at Turn 11, only to lose the place again with a lock-up at Turn 17. “Nearly just had a big crash there,” reported Hamilton over the radio in response to the first overtake, having been squeezed towards the wall.\n Hamilton regained his composure to attack Hulkenberg once more over the following laps, this time making a move stick for good under braking for Turn 11, and it was not long before the German lost eighth to the other Mercedes of Russell.\n Williams and Kick Sauber were the first teams to pit as the lap count edged past double figures, with all four taking on hard tyres, while Hulkenberg also decided that enough was enough after losing out to the Silver Arrows as he switched to the white-marked rubber.\n Attention then turned to when the front-runners would pit, as Verstappen stretched out his advantage over Piastri to some three seconds, followed by Leclerc, Sainz, Perez and Norris, who was doing his best to get past the second of the Red Bulls but could not quite get close enough.\n Perez released Norris into some welcome clean air when he became the first of the leading group to pit for fresh tyres on Lap 18, returning to the track with hard rubber bolted to his car in 10th position, behind Hamilton, Russell, Tsunoda and Ocon.\n It did not take long for the next stop to arrive, as Leclerc boxed on Lap 20 and followed Perez onto hards, with a particularly quick service from Ferrari – dipping under the two-second mark – putting pressure on Piastri and McLaren ahead of their visit to the pits.\n It was all looking under control for Verstappen until he skipped over the Turn 14/15 chicane and struck a bollard, which he carried with him for a few more metres and disposed of at the exit of Turn 16, prompting the Dutchman to radio his team and ask for a front wing check.\n A Virtual Safety Car was soon deployed to allow a marshal to hop over the wall and retrieve the out-of-place bollard, prompting ‘cheap’ stops for Ocon, Alonso and Magnussen under the caution, with leader Verstappen then pitting at the end of Lap 23 after the VSC had ended.\n Piastri, Sainz and Norris all continued up front, rather than immediately following Verstappen onto new tyres, while TV cameras picked up a thrilling four-way scrap involving Ocon, Hulkenberg, Alonso and Gasly as cars filtered back in from their pit stops.\n “It’s impossible to see the kerb now in the chicane,” reported Hamilton over the radio, following Verstappen’s moment, before he followed team mate Russell into the pits – the seven-time champion taking on mediums, and the younger Briton moving to hards.\n On Lap 27, race leader Piastri decided it was time to pit, followed by Sainz, as both drivers switched to hard tyres and gave Norris a run at the head of the field – leaving the latter, Tsunoda, Zhou and Ricciardo as the only drivers yet to stop.\n Moments later, the yellow flags came out – and then a full Safety Car was deployed – for an incident involving Magnussen and Sargeant, playing brilliantly into the hands of Norris, who was now able to complete his pit stop with a much smaller time loss.\n Tsunoda, Zhou and Ricciardo also took the opportunity to swap tyres, with Perez coming in for a second time, as replays showed Magnussen attempting a move on Sargeant through the Turn 2 flick, where contact sent the American into the barriers and the Dane back to the pits for repairs.\n Sargeant swiftly reported over the radio that he was “okay”, but his Williams had sustained terminal damage upon impact and, as such, it marked a disappointing end to the first of three home Grands Prix he is set to take part in this season.\n After that drama, Norris came back out from his stop in front of Verstappen, with Leclerc holding third over the demoted Piastri, Sainz and Perez, followed by Tsunoda, Hamilton, Russell and Ocon in the final points-paying positions as it stood.\n An update from the stewards then confirmed that Magnussen would be given a 10-second time penalty for the clash that forced Sargeant into retirement, adding to the series of sanctions he received in his wheel-to-wheel battling with Hamilton in the Sprint race.\n At the end of Lap 32, and following some more midfield stops, the Safety Car peeled into the pits and Norris got the encounter back under way, but the McLaren racer immediately came under pressure from Verstappen and had to go defensive through the first sector to keep his place at the head of the pack.\n An error from Verstappen then gave Norris some breathing space, after which he pumped in a series of rapid sector times to move out of DRS range, while the other McLaren of Piastri got involved in a scrap with Sainz down at Turn 11 – the latter feeling that he was forced off the track in the process.\n Norris continued to edge away from Verstappen as the laps ticked by, building a 2.5s cushion over with 20 tours to go, as the second-placed man reported over the radio that “I can’t get the car to turn” and described the situation as a “disaster”.\n After expressing frustration that Piastri had escaped a penalty for their earlier scuffle, Sainz managed to find a way past at Turn 17, with the McLaren driver fighting back at Turn 1 but then locking up and losing places to the Spaniard, Perez and Hamilton.\n With replays showing contact between Sainz and Piastri under braking for Turn 17 (an incident that will be looked at by the stewards post-race), Piastri sustained some damage to his front wing and was forced to pit for a new one, adding insult to injury as he dropped all the way to the back of the field.\n Piastri then set about charging his way up the order and attempting to get back into the points, but some lock-ups and wheel-to-wheel moments prompted a reminder from his race engineer not to get involved in any drama that could cause another Safety Car and compromise Norris.\n Some other late action involved Albon and Stroll, with the latter going off track in his quest to come out on top and landing a 10-second time penalty as a result, meaning any hope he had of scoring points were dashed.\n Up front, there were no such dramas as Norris – driving with plenty of confidence and maturity – expertly saw out the final few laps to become a Grand Prix winner for the very first time, while earning McLaren their first win in almost three years.\n Verstappen was some 7.5 seconds back in the runner-up spot, with Leclerc a couple of seconds further adrift in third, Sainz taking fourth ahead of his trip to the stewards alongside Piastri, and Perez completing the top five positions.\n Mercedes scored points with Hamilton and Russell in sixth and eighth, split by Tsunoda, as Alonso and Ocon completed the top-10 places from Hulkenberg, Gasly, the recovering Piastri, Zhou, Ricciardo, Bottas and Stroll.\n Albon was the final finisher in 19th, via a lock-up at Turn 17 and late pit stop, with team mate Sargeant having to watch the rest of his home race from the sidelines after being punted out at mid-distance by Magnussen, who wound up 18th via that extra pit stop for repairs."

    },
    {
      "id": 2,
      "title": "Module 3 Project",
      "description": "Create a full-stack application using MERN stack.",
      "userId": 1
    }
  ],
  "driver": [
    {
      "id": 1,
      "projectId": 1,
      "description": "Use Vite to create a basic React app"
    },
    {
      "id": 2,
      "projectId": 1,
      "description": "Install React Router and setup routes"
    },
    {
      "id": 3,
      "projectId": 2,
      "description": "Create a form with 5 input fields"
    }
  ]
}
