{
  "articles": [
    {
      "id": 1,
      "title": "Norris beats Verstappen for breakthrough maiden F1 victory in action-packed Miami Grand Prix",
      "subtitle": "McLaren driver Lando Norris added his name to the list of Formula 1 race winners with a sensational breakthrough victory in Sundays Miami Grand Prix, overhauling Red Bull rival Max Verstappen to take the chequered flag.",
      "text": "Norris ran sixth in the early stages of the race, with fast-starting team mate Oscar Piastri the McLaren man who initially looked most likely to cause an upset, but a Safety Car at the midway point played perfectly into the Briton’s hands after he extended his opening stint.\n Norris emerged from the pits in the lead, with Verstappen demoted to second after stopping under normal racing conditions, and despite an initial attack from the latter at the restart, the Briton managed to maintain the position and then edge clear.\n A cool, calm and collected performance thereafter, and balance problems for Verstappen, meant there was no stopping Norris from banishing the demons of his near-miss at the 2021 Russian Grand Prix and becoming a race winner at the 110th time of asking.Verstappen settled for second amid his relative struggles behind the wheel, while Charles Leclerc completed the podium ahead of Ferrari team mate Carlos Sainz, who clashed with Piastri late on in an incident that sent the Australian back into the pits for a new front wing.\n Sergio Perez wound up fifth in the second of the Red Bulls, having completed another stop under the Safety Car, as Lewis Hamilton and George Russell salvaged some solid points on a challenging weekend for Mercedes in sixth and eighth respectively.\n Yuki Tsunoda gave RB another reward in seventh, while Aston Martin’s Fernando Alonso crossed the line ninth and Esteban Ocon capitalised on Piastri’s problems to finish 10th and score a morale-boosting first point of the season for the Alpine team.\n Haas had been on course for another top-10 result in the opening exchanges, only for Nico Hulkenberg to slip down the order as the race developed, leaving him 11th at the flag from the other Alpine machine of Pierre Gasly.\n Piastri battled his way back up to 13th after that aforementioned front wing change, albeit being warned by McLaren not to spark another incident and Safety Car period as Norris led, clearing Zhou Guanyu’s Kick Sauber just before the finish.\n After starring in the Sprint, Daniel Ricciardo could do no more than 15th on Grand Prix day, followed by Valtteri Bottas (Kick Sauber) and Lance Stroll (Aston Martin), whose fierce battle with Williams rival Alex Albon saw him earn a 10-second time penalty for leaving the track and gaining an advantage.\n Albon was the final finisher in 19th, behind the Haas of Kevin Magnussen, who served a 10-second sanction of his own for a collision with Williams driver Logan Sargeant that put the home favourite out of the race.\n As the drivers headed back to the pits, the emotions came out for Norris over the radio as he and his race engineer, along with team boss Zak Brown, revelled in a milestone moment that also gave McLaren a first Grand Prix win since Monza back in 2021.\n After an action-packed double-header of the Sprint race and Grand Prix qualifying on Saturday, which reigning world champion Verstappen mastered, attention soon turned to Sunday’s main event and 57 laps around the Miami International Autodrome.\n Only one change was made to the starting order after the grid-deciding session, with Ricciardo going from 18th to 20th thanks to the application of a three-place penalty he picked up at the previous race in China for breaching the Safety Car regulations.\n When the field lined up on the grid and the tyre blankets came off, it was confirmed that most drivers would be starting on the medium rubber, while Hamilton, Alonso, Magnussen and Ricciardo opted for hards, and Bottas softs, in what Pirelli expected to be a one-stop encounter.\n Pole-sitter Verstappen managed to defend his lead off the line for the second time this weekend as the race got under way, slotting in front of squabbling team mates Leclerc and Sainz, who had to take avoiding action when Perez dramatically locked up and fired his way into the first corner.\n Perez’s mistake, along with the Ferraris almost banging wheels, opened the door for Piastri to pull off a remarkable rise from sixth to third at the exit of Turn 1, just behind Leclerc, with Sainz slipping back to fourth from the recovering Perez, Norris, Hamilton and Hulkenberg.\n Further back, Alpine pair Ocon and Gasly went wheel-to-wheel for several corners in an exchange that no doubt raised heartrates on the Alpine pit wall, until the latter settled it in his favour, while Hulkenberg pounced on the hard-shod Hamilton at the start of Lap 2 for seventh.\n A couple of tours later, rather than looking in his mirrors, Piastri edged closer to Leclerc and used the Drag Reduction System on the lengthy run between Turns 16 and 17 to snatch second place from the Monegasque, as race leader Verstappen now sat two seconds up the road.\n As the race settled down, a series of opening lap replays, including an onboard from Perez, showed that the Mexican came perilously close to running into the back of team mate Verstappen at Turn 1, with the stewards looking into a potential jump start before deciding against any further action.\n With his hard tyres coming into play, Hamilton muscled his way past Hulkenberg for P7 at Turn 11, only to lose the place again with a lock-up at Turn 17. “Nearly just had a big crash there,” reported Hamilton over the radio in response to the first overtake, having been squeezed towards the wall.\n Hamilton regained his composure to attack Hulkenberg once more over the following laps, this time making a move stick for good under braking for Turn 11, and it was not long before the German lost eighth to the other Mercedes of Russell.\n Williams and Kick Sauber were the first teams to pit as the lap count edged past double figures, with all four taking on hard tyres, while Hulkenberg also decided that enough was enough after losing out to the Silver Arrows as he switched to the white-marked rubber.\n Attention then turned to when the front-runners would pit, as Verstappen stretched out his advantage over Piastri to some three seconds, followed by Leclerc, Sainz, Perez and Norris, who was doing his best to get past the second of the Red Bulls but could not quite get close enough.\n Perez released Norris into some welcome clean air when he became the first of the leading group to pit for fresh tyres on Lap 18, returning to the track with hard rubber bolted to his car in 10th position, behind Hamilton, Russell, Tsunoda and Ocon.\n It did not take long for the next stop to arrive, as Leclerc boxed on Lap 20 and followed Perez onto hards, with a particularly quick service from Ferrari – dipping under the two-second mark – putting pressure on Piastri and McLaren ahead of their visit to the pits.\n It was all looking under control for Verstappen until he skipped over the Turn 14/15 chicane and struck a bollard, which he carried with him for a few more metres and disposed of at the exit of Turn 16, prompting the Dutchman to radio his team and ask for a front wing check.\n A Virtual Safety Car was soon deployed to allow a marshal to hop over the wall and retrieve the out-of-place bollard, prompting ‘cheap’ stops for Ocon, Alonso and Magnussen under the caution, with leader Verstappen then pitting at the end of Lap 23 after the VSC had ended.\n Piastri, Sainz and Norris all continued up front, rather than immediately following Verstappen onto new tyres, while TV cameras picked up a thrilling four-way scrap involving Ocon, Hulkenberg, Alonso and Gasly as cars filtered back in from their pit stops.\n “It’s impossible to see the kerb now in the chicane,” reported Hamilton over the radio, following Verstappen’s moment, before he followed team mate Russell into the pits – the seven-time champion taking on mediums, and the younger Briton moving to hards.\n On Lap 27, race leader Piastri decided it was time to pit, followed by Sainz, as both drivers switched to hard tyres and gave Norris a run at the head of the field – leaving the latter, Tsunoda, Zhou and Ricciardo as the only drivers yet to stop.\n Moments later, the yellow flags came out – and then a full Safety Car was deployed – for an incident involving Magnussen and Sargeant, playing brilliantly into the hands of Norris, who was now able to complete his pit stop with a much smaller time loss.\n Tsunoda, Zhou and Ricciardo also took the opportunity to swap tyres, with Perez coming in for a second time, as replays showed Magnussen attempting a move on Sargeant through the Turn 2 flick, where contact sent the American into the barriers and the Dane back to the pits for repairs.\n Sargeant swiftly reported over the radio that he was “okay”, but his Williams had sustained terminal damage upon impact and, as such, it marked a disappointing end to the first of three home Grands Prix he is set to take part in this season.\n After that drama, Norris came back out from his stop in front of Verstappen, with Leclerc holding third over the demoted Piastri, Sainz and Perez, followed by Tsunoda, Hamilton, Russell and Ocon in the final points-paying positions as it stood.\n An update from the stewards then confirmed that Magnussen would be given a 10-second time penalty for the clash that forced Sargeant into retirement, adding to the series of sanctions he received in his wheel-to-wheel battling with Hamilton in the Sprint race.\n At the end of Lap 32, and following some more midfield stops, the Safety Car peeled into the pits and Norris got the encounter back under way, but the McLaren racer immediately came under pressure from Verstappen and had to go defensive through the first sector to keep his place at the head of the pack.\n An error from Verstappen then gave Norris some breathing space, after which he pumped in a series of rapid sector times to move out of DRS range, while the other McLaren of Piastri got involved in a scrap with Sainz down at Turn 11 – the latter feeling that he was forced off the track in the process.\n Norris continued to edge away from Verstappen as the laps ticked by, building a 2.5s cushion over with 20 tours to go, as the second-placed man reported over the radio that “I can’t get the car to turn” and described the situation as a “disaster”.\n After expressing frustration that Piastri had escaped a penalty for their earlier scuffle, Sainz managed to find a way past at Turn 17, with the McLaren driver fighting back at Turn 1 but then locking up and losing places to the Spaniard, Perez and Hamilton.\n With replays showing contact between Sainz and Piastri under braking for Turn 17 (an incident that will be looked at by the stewards post-race), Piastri sustained some damage to his front wing and was forced to pit for a new one, adding insult to injury as he dropped all the way to the back of the field.\n Piastri then set about charging his way up the order and attempting to get back into the points, but some lock-ups and wheel-to-wheel moments prompted a reminder from his race engineer not to get involved in any drama that could cause another Safety Car and compromise Norris.\n Some other late action involved Albon and Stroll, with the latter going off track in his quest to come out on top and landing a 10-second time penalty as a result, meaning any hope he had of scoring points were dashed.\n Up front, there were no such dramas as Norris – driving with plenty of confidence and maturity – expertly saw out the final few laps to become a Grand Prix winner for the very first time, while earning McLaren their first win in almost three years.\n Verstappen was some 7.5 seconds back in the runner-up spot, with Leclerc a couple of seconds further adrift in third, Sainz taking fourth ahead of his trip to the stewards alongside Piastri, and Perez completing the top five positions.\n Mercedes scored points with Hamilton and Russell in sixth and eighth, split by Tsunoda, as Alonso and Ocon completed the top-10 places from Hulkenberg, Gasly, the recovering Piastri, Zhou, Ricciardo, Bottas and Stroll.\n Albon was the final finisher in 19th, via a lock-up at Turn 17 and late pit stop, with team mate Sargeant having to watch the rest of his home race from the sidelines after being punted out at mid-distance by Magnussen, who wound up 18th via that extra pit stop for repairs.",
      "date": "5/5/2024",
      "comments": ""
    },
    {
      "id": 2,
      "title": "Hunger, ingenuity and modesty – How ‘Einstein of F1’ Newey helped transform Red Bull’s fortunes",
      "subtitle": "Adrian Newey was in the headlines during the build-up to the Miami Grand Prix with the announcement he is to leave Red Bull in early 2025, ending an almost two-decade stint at the operation that has so far yielded a whopping 117 race wins, six constructors’ titles and seven drivers’ crowns.",
      "text": "The story began when Red Bull targeted Newey shortly after their F1 arrival in 2005, with Team Principal Christian Horner and driver David Coulthard devising a plan to get hold of – even at that stage – one of the most esteemed designers in the sport’s history.\n After producing promising cars for March/Leyton House at the beginning of his career in the late-1980s and early-1990s, Newey got his big break at Williams, playing a key role in five constructors’ and four drivers’ titles – with Nigel Mansell, Alain Prost, Damon Hill and Jacques Villeneuve – from 1992 to 1997.\n Then, for his next chapter, Newey joined another established British team in McLaren, where he again tasted title glory by contributing to both the drivers’ and constructors’ championships in 1998 and another drivers’ title in 1999, with Mika Hakkinen spearheading that particular charge alongside Coulthard.An important side note is that Coulthard had been a colleague of Newey’s at both Williams and McLaren, meaning he was well aware of his capabilities and could make the necessary introductions at Red Bull – which led to decisive talks in Austria with late company co-owner Dietrich Mateschitz.\n Changing the team’s image\n And so, in early 2006, Newey walked through the Red Bull factory doors to get to work.But according to Christian Klien, who raced alongside Coulthard across Red Bull’s first two seasons, there was a noticeable change regarding the squad’s perception amongst their rivals before Newey had even settled into his new office and put pencil to paper (his preferred way of designing F1 cars).\n When Red Bull took over the Jaguar entry and landed in the paddock, they were quickly given the ‘party team’ nickname thanks to a combination of bold marketing activities, enormous hospitality areas and a general approach that had not been seen in F1 before.\n But Newey’s arrival helped to shift the narrative and demonstrate that, while Red Bull were shaking things up off the track, their primary goal was to succeed on it.\n “It was really a milestone for Red Bull to get Adrian onboard,” said Klien, who had raced under the team’s previous Jaguar guise and was retained when they were purchased by the drinks company, completing part-campaigns alongside Coulthard in 2005 and 2006.“You could also feel in the paddock that Red Bull were not only there to be the party team, but they were also taking it seriously if they had [signed] Adrian Newey.\n “It’s not just that you’re there to fill the grid slots, you want to achieve something. I think that was the turning point for the team to get onto the road to success.”Winning is never enough\n That success soon followed, for after 2007 and 2008 seasons featuring points finishes and a couple of podiums, the rules reset in 2009 presented every design team on the grid – including the one Newey had been overseeing and building up at Red Bull – a golden opportunity.\n While some rivals (see Brawn GP) gained an early advantage via the controversial double diffuser concept, Red Bull still leapt up the order with a much more competitive package compared to previous years, claiming their first pole positions and victories and finishing second in both championships after they introduced their own version of the aforementioned innovation.\n A year later, Red Bull were double world champions and heading into a period of domination.\n Mark Webber, who was in the cockpit for the transformation from points scorers in 2007 to world champions in 2010, noted how Newey’s previous experiences of winning with Williams and McLaren were of vital importance as Red Bull stepped forward.“When we started to have early successes, a lot of one-twos, I think that was great for Christian too, because Christian obviously hadn’t experienced that, and Helmut [Marko, Red Bull advisor] hadn’t experienced that, but Adrian had,” he commented.\n “Adrian was sort of working out, ‘Well, hang on, our pit stops are still s**t, let’s work on those.’ There were always other layers and it was like, ‘Holy hell, when’s this guy going to finish?’”\n Highlighting Newey’s unquenchable thirst for success, Webber said: “He continues to understand that yesterday was never good enough, and that’s what I loved about him.”Pushing the boundaries\n In that 2010 season, the Newey-led technical team went up another gear, introducing their own groundbreaking developments such as the blown diffuser – used for two campaigns before it was outlawed – which Webber and Sebastian Vettel deployed to devastating effect.\n It’s just one of the many bright ideas Newey has unleashed during his lengthy career in F1, and at Red Bull specifically, with those who have worked alongside him – and witnessed how he operates behind the scenes – often taken aback by how he seemingly rewrites the rules.Robert Doornbos, who served as a Red Bull test driver and made three Grand Prix appearances for the outfit in the closing stages of the 2006 season, highlighted this with an amusing tale.\n “Adrian is like the Einstein of F1,” the Dutchman stated, explaining that he “really understood his brain” when they worked together during a test day.“At one stage, he asked me if I thought it would be possible to drive an F1 car with two feet on top of each other, with the brake on the bottom and the throttle on top of the brake, so the car could be sleeker and slicker on the front end,” Doornbos continued.\n “I was like, ‘Physically that’s not possible’. He looked at me and wrote something down. He said, ‘I want to change something’. I said, ‘What?’ He said, ‘It’s between the steering wheel and the engine’. I said, ‘That’s me!’\n “Basically, if you give him a free hand, he wants to have a robot inside the car or something, so the balance of the human factor and him thinking only in numbers and data is quite extraordinary to work with. He pushes the boundaries.”Understated and humble\n In addition to his wide-ranging skills as a designer, Newey has received plenty of plaudits for his humble and respectful nature.\n He is known for shying away from the spotlight at race weekends, rarely speaking to print media or broadcasters, and when he does put himself forward for an interview, he often redirects compliments that come his way to the team around him.At the Miami Grand Prix, for example, when Sky Sports F1’s Martin Brundle quizzed him about leaving Red Bull, his very first answer was an attempt to move the focus elsewhere.\n “Honestly, when I joined, I had no idea where we were going to end up,” he began. “It was quite a big career risk from me, and it’s just been an amazing ride since then. It’s been a tremendous honour working with all the amazing guys and girls at the factory [and] at the race team.”\n It’s something Webber experienced first-hand as he praised Newey for an “extremely open and honest” way of operating and working effectively with those around him.“He’s a tremendous listener – you don’t have the career that Adrian’s had if an individual like him doesn’t listen,” said Webber, who won nine Grands Prix in Newey-designed cars.\n “I love how understated he is, I love how immensely humble he is. He should be knighted, end of. It’s not even a discussion in my book.”A foundation for future success\n Over the years, Newey has taken steps back from the frontline and then returned to the fore without fanfare, most recently ahead of F1’s new era of ground effect regulations coming into play in 2022 – allowing him to tap into experiences from some three decades ago.\n But as touched on above, the wider design team at Red Bull now includes talents such as Technical Director Pierre Wache, Head of Aerodynamics Enrico Balbo and Chief Engineer for Performance Ben Waterhouse, amongst others.\n As well as praising Newey for the race wins and world titles delivered so far, team boss Horner made clear that the 65-year-old has played his part in developing the strength in depth Red Bull now boast for the future.“We’ve been having to think about this moment for some time; it was always going to come at some point,” said Horner shortly after news of Newey’s impending exit dropped.\n “I think the structure that we’ve got in place – which Adrian has helped contribute to morph and mould into the package that it now is – is well set to take up the baton and continue to produce fantastic cars like we have.“Adrian’s role was unique. Adrian is unique. He drew on a drawing board and the way he operated was totally unique. He didn’t have anybody report to him and he was a free spirit within the organisation.\n “The organisation stays exactly as it is, we’ve got strength and stability and strength in depth, and we’re grateful for the time and the shape that he’s left the technical team in.”\n With six rounds of the 2024 season completed, Red Bull are well on their way to what would be a third successive title double – and the perfect end to Newey’s spectacular spell onboard.",
      "date": "5/10/2024",
      "comments": ""
    },
    {
      "id": 3,
      "title": "Hamilton thrilled with ‘tough battles’ in Miami while Russell rues ‘pretty rubbish race from start to finish’",
      "subtitle": "There were contrasting emotions in the Mercedes garage after the Miami Grand Prix, with Lewis Hamilton left in high spirits after enjoying some close on-track battles en route to P6, while George Russell rued his lack of pace following his P8 result on a “difficult weekend”.",
      "text": "It was a busy afternoon for Hamilton in Miami, as the seven-time world champion initially struggled for pace on the hard tyre in the opening stint before engaging in a fierce fight with the Haas of Nico Hulkenberg across several laps.With his pace appearing stronger on the medium compound in the latter half of the race, Hamilton looked to be on the tail of Red Bull’s Sergio Perez. While he was ultimately unable to find a way past, the 39-year-old was encouraged by the level of performance in his W15 across the weekend, with P6 also marking his strongest race result of the season so far.\n Asked after jumping out of the car if the race had been fun for him, a smiling Hamilton responded: “So much fun. I’ve really enjoyed this weekend race-wise. It’s been a lot of fun on track, [I’ve had] really great, tough, close battles. I mean, going out to Turn 11, up against the wall, wheels locked – I was like, ‘oh jeez, this could be either a big crash into this corner or I’m going by’.“So I love that I had that, in zero fear in that moment, so I’m super grateful for that. Then to be able to hold onto the [Red] Bulls, to a Red Bull, was really quite cool, great job by my team.”\n Hamilton also took a moment to acknowledge race winner Lando Norris, who claimed his debut victory in the sport after a five-year wait.“Massive congratulations to Lando,” said Hamilton. “[I] won my first Grand Prix with McLaren, I know how special it is to get that first one, so huge congratulations to him. He truly deserves it, and McLaren – wow. I’m really, really happy for them, it’s my old family.”While Hamilton had experienced a positive afternoon in Miami, Russell was left disappointed by his own performance. The Briton dropped backwards at the start of the race and then tried to battle back into a points-paying position.He achieved this by ending the day in P8, but was brutally honest about how his afternoon had panned out: “It was a pretty rubbish race from start to finish, in all honesty. I had a good start but when Checo [Perez] sent it down the inside, when he rejoined everybody had to check up a bit and it cost me three positions.Then [I] just had no pace at all there on in, so I need to check the car, check the data because something didn’t feel quite right.”\n With P8 marking Russell’s lowest result so far in 2024 – barring his DNF in the Australian Grand Prix – he acknowledged that the weekend in Miami had proven to be a particularly challenging one.“It’s definitely felt like a more difficult weekend than all of the others, but the results have all really been relatively similar,” he explained. “We are between P5 on a good day and P8 on a bad day, and today was a bad day, we finished P8.“Lewis had a good day, drove really well and finished P6. It’s kind of where we are.”",
      "date": "5/6/2024",
      "comments": ""
    }
  ],
  "drivers": [
    {
      "id": 1,
      "name": "Max Verstappen",
      "worldTitles": 3,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/verstappen"
    },
    {
      "id": 2,
      "name": "Sergio Perez",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/perez"
    },
    {
      "id": 3,
      "name": "Charles Leclerc",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/leclerc"
    },
    {
      "id": 5,
      "name": "Carlos Sainz",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/sainz"
    },
    {
      "id": 4,
      "name": "Lando Norris",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/norris"
    },
    {
      "id": 6,
      "name": "Oscar Piastri",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/piastri"
    },
    {
      "id": 7,
      "name": "George Russell",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/russell"
    },
    {
      "id": 9,
      "name": "Lewis Hamilton",
      "worldTitles": 7,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/hamilton"
    },
    {
      "id": 8,
      "name": "Fernando Alonso",
      "worldTitles": 2,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/alonso"
    },
    {
      "id": 11,
      "name": "Lance Stroll",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_auto,w_1320/content/dam/fom-website/drivers/2024Drivers/stroll"
    },
    {
      "id": 10,
      "name": "Yuki Tsunoda",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/tsunoda"
    },
    {
      "id": 13,
      "name": "Daniel Ricciardo",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/ricciardo"
    },
    {
      "id": 12,
      "name": "Nico Hulkenberg",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/hulkenberg"
    },
    {
      "id": 15,
      "name": "Kevin Magnussen",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/magnussen"
    },
    {
      "id": 14,
      "name": "Esteban Ocon",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/ocon"
    },
    {
      "id": 18,
      "name": "Pierre Gasly",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/gasly"
    },
    {
      "id": 17,
      "name": "Zhou Guanyu",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/zhou"
    },
    {
      "id": 19,
      "name": "Valtteri Bottas",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/bottas"
    },
    {
      "id": 16,
      "name": "Alexander Albon",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/albon"
    },
    {
      "id": 20,
      "name": "Logan Sargeant",
      "worldTitles": 0,
      "image": "https://media.formula1.com/image/upload/f_auto,c_limit,q_75,w_1320/content/dam/fom-website/drivers/2024Drivers/sargeant"
    }
  ],
  "events": [
    {
      "id": 1,
      "title": "FORMULA 1 MSC CRUISES GRAN PREMIO DEL MADE IN ITALY E DELL'EMILIA-ROMAGNA 2024",
      "round": 7,
      "startDate": "5/17/2024",
      "endDate": "5/19/2024",
      "location": "Italy"
    },
    {
      "id": 2,
      "title": "FORMULA 1 GRAND PRIX DE MONACO 2024",
      "round": 8,
      "startDate": "5/24/2024",
      "endDate": "5/26/2024",
      "location": "Monaco"
    },
    {
      "id": 3,
      "title": "FORMULA 1 AWS GRAND PRIX DU CANADA 2024",
      "round": 9,
      "startDate": "6/7/2024",
      "endDate": "6/9/2024",
      "location": "Canada"
    },
    {
      "id": 4,
      "title": "FORMULA 1 ARAMCO GRAN PREMIO DE ESPAÑA 2024",
      "round": 10,
      "startDate": "6/21/2024",
      "endDate": "6/23/2024",
      "location": "Spain"
    },
    {
      "id": 5,
      "title": "FORMULA 1 QATAR AIRWAYS AUSTRIAN GRAND PRIX 2024",
      "round": 11,
      "startDate": "6/28/2024",
      "endDate": "6/30/2024",
      "location": "Austria"
    }
  ]
}